<script setup lang="ts"></script>

<template>
  <div class="icon" title="公开帖子">
    <svg
      t="1743841194201"
      viewBox="0 0 1024 1024"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
      p-id="5183"
      xmlns:xlink="http://www.w3.org/1999/xlink"
      width="25"
      height="25"
    >
      <path
        d="M666.752 194.517333L617.386667 268.629333A128 128 0 0 0 384 341.333333l0.042667 85.333334h384a85.333333 85.333333 0 0 1 85.333333 85.333333v256a85.333333 85.333333 0 0 1-85.333333 85.333333H256a85.333333 85.333333 0 0 1-85.333333-85.333333v-256a85.333333 85.333333 0 0 1 85.333333-85.333333h42.666667V341.333333a213.333333 213.333333 0 0 1 368.085333-146.816z"
        p-id="5184"
      ></path>
    </svg>
  </div>
</template>

<style scoped lang="scss"></style>
